<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [1]:
import sqlite3
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
# Establish connection to database
conn = sqlite3.connect('Northwind_small.sqlite')
cur = conn.cursor()

In [3]:
# Create query template
# cur.execute('''

#             ;''')
# df = pd.DataFrame(cur.fetchall())
# df.columns = [x[0] for x in cur.description]
# df.head()

In [12]:
# View table names
cur.execute('''
            SELECT name
            FROM sqlite_master
            WHERE type = 'table'
            ;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

       name
0  Employee
1  Category
2  Customer
3   Shipper
4  Supplier

In [16]:
# Get list of contacts at suppliers
# (Practice string concatenation)
cur.execute('''
            SELECT ContactName||', '||ContactTitle||', '||CompanyName
            FROM Supplier
            ;''')
df = pd.DataFrame(cur.fetchall())
df.columns = ['Supplier Contacts']
df.head()

                                   Supplier Contacts
0  Charlotte Cooper, Purchasing Manager, Exotic L...
1  Shelley Burke, Order Administrator, New Orlean...
2  Regina Murphy, Sales Representative, Grandma K...
3     Yoshi Nagase, Marketing Manager, Tokyo Traders
4  Antonio del Valle Saavedra, Export Administrat...

In [25]:
# Determine whether employees are 'veterans' or 'newbies' based on HireDate
# Return percentages of veterans and newbies
cur.execute('''
            SELECT LastName||', '||FirstName AS Name, HireDate,
                CASE WHEN HireDate < '2025-01-01' THEN 'Veteran'
                     WHEN HireDate >= '2025-01-01' THEN 'Newbie'
                     ELSE 'Other'
                END AS Status
            FROM Employee
            ;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.Status.value_counts(normalize=True)

Newbie     0.666667
Veteran    0.333333
Name: Status, dtype: float64

In [30]:
# (Practice ordering results based on evaluation of a condition.)
cur.execute('''
            SELECT FirstName, LastName, BirthDate, City, PostalCode
            FROM Employee
            ORDER BY 
                CASE WHEN Birthdate > '1990-01-01' 
                         THEN City 
                         ELSE PostalCode 
                END
            ;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(20)

  FirstName   LastName   BirthDate      City PostalCode
0  Margaret    Peacock  1969-09-19   Redmond      98052
1     Nancy    Davolio  1980-12-08   Seattle      98122
2    Andrew     Fuller  1984-02-19    Tacoma      98401
3     Janet  Leverling  1995-08-30  Kirkland      98033
4   Michael     Suyama  1995-07-02    London    EC2 7JR
5    Robert       King  1992-05-29    London    RG1 9SP
6      Anne  Dodsworth  1998-01-27    London    WG2 7LT
7    Steven   Buchanan  1987-03-04    London    SW1 8JR
8     Laura   Callahan  1990-01-09   Seattle      98105